{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "batch_input_shape": [null, 50, 50, 3], "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}